cf/Catalogs/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтGarage</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтLicota</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтProm</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияКартинки</Name>
					<Comment>значит что эта картинка точно такаяже и на нее ссылается текущая картинка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КартинкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеЛокальный</Name>
					<Comment>относительный путь к файлу в облаке относительно сервера 1с</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеHTTP</Name>
					<Comment>Относительный путь к картинке из вне по http</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеАватар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеКартинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИконкаКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/КомандыHTTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КомандыHTTP</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/КартинкиНоменклатуры/Ext/ObjectModule.bsl
Процедура СохранитьКартинку(текКартинка, Префикс, Отказ, Формат)
	
	Если текКартинка <> Неопределено Тогда
		
		Формат 		= КонвертацияТипов.РасширениеКартинки(текКартинка);
		
		ИмяФайла 	= КэшируемыеФункции.ПолучитьПутьКОблакуЛокально() + "\products\" + Формат(Владелец.ПорядковыйНомер, "ЧГ=") + "-" + Наименование + "-" + Префикс + "." + Формат;
			
		Попытка
			текКартинка.Записать(ИмяФайла);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки в облако
			|ИмяФайла = " + ИмяФайла + "
			|" + стрОшибки);
			Отказ = Истина; КонецПопытки; КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Проверим что нет одинаковых справочник с основным реквизитом
	//	представление должно быть одним
	//	поэтому если их несколько то заберем основное представление у другого
	
	Если Не ОбменДанными.Загрузка Тогда
	
		Если ЭтоПредставлениеОбъекта Тогда
		
			Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник." + Метаданные().Имя + " ГДЕ Владелец = &Владелец И Ссылка <> &Ссылка И ЭтоПредставлениеОбъекта = ИСТИНА");
			Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
			Запрос.УстановитьПараметр("Владелец",	Владелец);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СправочникОбъект.ЭтоПредставлениеОбъекта = Ложь;
				
				Попытка
					СправочникОбъект.Записать();
				Исключение
					ОпОшибки = ОписаниеОшибки();
					ОбщиеФункции.СообщитьТекст("Ошибка при снятии основной картинки с объекта" + Выборка.Ссылка + "
					|" + ОпОшибки);
					Отказ = Истина;
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		
		// Выгрузим на сайт
		
		//Если Не Отказ И ВыгружатьНаСайт И не HTTP.ДатьЗаданиеНаИзменениеСайту(Владелец, Перечисления.КомандыHTTP.PUT, "/api/products.json",,Ложь) Тогда Отказ = Истина КонецЕсли;
		
		#Если Не ВнешнееСоединение Тогда
		
			Если Не Отказ И (ВыгружатьНаСайт ИЛИ ДополнительныеСвойства.ТекОбъект.ВыгружатьНаСайт) Тогда 
				ПараметрыЗаписи = Неопределено;
				Если ВыгружатьНаСайт И НЕ ПометкаУдаления Тогда
					АдресРесурсаСервера	= ?(Владелец.ЭтоГруппа, "/api/product_categories", "/api/products");
					
					Если Владелец.ЭтоГруппа Тогда
						ОбновляемыеДанные = API2.ПолучитьКатегории(Новый Структура("Ссылка", Владелец)); //Новый Структура("image", Ссылка);
					Иначе // это элемент номенклатуры
						//лКартинки = Новый Массив;
						//лКартинки.Добавить(Новый Структура("image, position", Ссылка, ?(ЭтоПредставлениеОбъекта, 0, 1)));
						//ОбновляемыеДанные = Новый Структура("images", лКартинки);
						
						ОбновляемыеДанные = API2.ПолучитьТовары(Новый Структура("Ссылка, Области", Владелец, Новый Структура("Картинки")));
		 			КонецЕсли;
					
					ПараметрыЗаписи = Новый Структура("КомандаHTTP, АдресРесурсаСервера, Очередь, Суффикс, ТелоЗапроса", 
												Перечисления.КомандыHTTP.POST,
												АдресРесурсаСервера,
												40,
												"update",
												ОбновляемыеДанные);
				ИначеЕсли НЕ Владелец.ЭтоГруппа Тогда
					
					АдресРесурсаСервера	= "/api/products";
					
					ПараметрыЗаписи = Новый Структура("КомандаHTTP, АдресРесурсаСервера, Очередь, Суффикс, ТелоЗапроса", 
												Перечисления.КомандыHTTP.POST,
												АдресРесурсаСервера,
												40,
												"update",
												API2.ПолучитьТовары(Новый Структура("Ссылка, Области", Владелец, Новый Структура("Картинки")))); 
				КонецЕсли;
											
				Если НЕ ПараметрыЗаписи = Неопределено Тогда 
					API2.ЗаписатьОбъектВБуферНаИзменениеНаСайте(Владелец, ПараметрыЗаписи, Отказ); 
				КонецЕсли; 
			КонецЕсли; 
			
		#КонецЕсли
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
	
		// Сохраним картинку в облаке
		Если Не Отказ И КопияКартинки.Пустая() Тогда
			
			СохранитьКартинку(Картинка.Получить(), 	"b", Отказ, РасширениеКартинка);
			//СохранитьКартинку(Аватар.Получить(), 	"s", Отказ, РасширениеАватар); 
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ДатаИзменения = ТекущаяДата();
			
			Если ЭтоНовый() Тогда
				ДополнительныеСвойства.Вставить("ТекОбъект", Новый Структура("ВыгружатьНаСайт, ПометкаУдаления, ЭтоПредставлениеОбъекта", Ложь, Ложь, Ложь));
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПометкаУдаления, ЭтоПредставлениеОбъекта, ВыгружатьНаСайт ИЗ Справочник.КартинкиНоменклатуры КАК КартинкиНоменклатуры ГДЕ Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Выборка = Запрос.Выполнить().Выбрать();
			    Если Выборка.Следующий() Тогда
					ДополнительныеСвойства.Вставить("ТекОбъект", Новый Структура("ВыгружатьНаСайт, ПометкаУдаления, ЭтоПредставлениеОбъекта", Выборка.ВыгружатьНаСайт, Выборка.ПометкаУдаления, Выборка.ЭтоПредставлениеОбъекта)); КонецЕсли; КонецЕсли; КонецЕсли;КонецЕсли;
	
КонецПроцедуры
